NGLCMDLineAssemblies/NGL.DTMS.CMDLine.BCIntegration/SendPicks.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <soap:Body>
        <SendPicks xmlns="urn:microsoft-dynamics-schemas/codeunit/DynamicsTMSWebServices">
            <dynamicsTMSPicks >
                <Pick xmlns="urn:microsoft-dynamics-nav/xmlports/DynamicsTMSPick">
                    <PLControl>10</PLControl>
                    <BookCarrOrderNumber>Test</BookCarrOrderNumber>
                    <BookConsPrefix>Test</BookConsPrefix>
                    <CarrierNumber>0</CarrierNumber>
                    <BookRevTotalCost>100</BookRevTotalCost>
                    <LoadOrder>0</LoadOrder>
                    <BookDateLoad>11/07/2023</BookDateLoad>
                    <BookDateRequired>11/07/2023</BookDateRequired>
                    <BookLoadCom>D</BookLoadCom>
                    <BookProNumber>Test</BookProNumber>
                    <BookRouteFinalCode>NS</BookRouteFinalCode>
                    <BookRouteFinalDate>11/07/2023</BookRouteFinalDate>
                    <BookTotalCases>0</BookTotalCases>
                    <BookTotalWgt>0</BookTotalWgt>
                    <BookTotalPL>0</BookTotalPL>
                    <BookTotalCube>0</BookTotalCube>
                    <BookTotalBFC>0</BookTotalBFC>
                    <BookStopNo>0</BookStopNo>
                    <CompName>Test</CompName>
                    <CompNumber>test</CompNumber>
                    <BookTypeCode>N</BookTypeCode>
                    <BookDateOrdered>11/07/2023</BookDateOrdered>
                    <BookOrigName>Test</BookOrigName>
                    <BookOrigAddress1>TEST</BookOrigAddress1>
                    <BookOrigAddress2>Test</BookOrigAddress2>
                    <BookOrigAddress3>Test</BookOrigAddress3>
                    <BookOrigCity>Test</BookOrigCity>
                    <BookOrigState>TN</BookOrigState>
                    <BookOrigCountry>Test</BookOrigCountry>
                    <BookOrigZip>Test</BookOrigZip>
                    <BookDestName>Test</BookDestName>
                    <BookDestAddress1>Test</BookDestAddress1>
                    <BookDestAddress2>Test</BookDestAddress2>
                    <BookDestAddress3>Test</BookDestAddress3>
                    <BookDestCity>Test</BookDestCity>
                    <BookDestState>TN</BookDestState>
                    <BookDestCountry>Test</BookDestCountry>
                    <BookDestZip>Test</BookDestZip>
                    <BookLoadPONumber>Test</BookLoadPONumber>
                    <CarrierName>Test</CarrierName>
                    <LaneNumber>Test</LaneNumber>
                    <CommCodeDescription>Test</CommCodeDescription>
                    <BookMilesFrom>0</BookMilesFrom>
                    <BookCommCompControl>0</BookCommCompControl>
                    <BookRevCommCost>0</BookRevCommCost>
                    <BookRevGrossRevenue>0</BookRevGrossRevenue>
                    <BookFinCommStd>0</BookFinCommStd>
                    <BookDoNotInvoice>false</BookDoNotInvoice>
                    <BookOrderSequence>0</BookOrderSequence>
                    <CarrierEquipmentCodes>Test</CarrierEquipmentCodes>
                    <BookCarrierTypeCode>Test</BookCarrierTypeCode>
                    <BookWarehouseNumber>Test</BookWarehouseNumber>
                    <CompNatNumber>0</CompNatNumber>
                    <BookTransType>Test</BookTransType>
                    <BookShipCarrierProNumber>Test</BookShipCarrierProNumber>
                    <BookShipCarrierNumber>Test</BookShipCarrierNumber>
                    <LaneComments>Test</LaneComments>
                    <FuelSurCharge>0</FuelSurCharge>
                    <BookRevCarrierCost>0</BookRevCarrierCost>
                    <BookRevOtherCost>0</BookRevOtherCost>
                    <BookRevNetCost>0</BookRevNetCost>
                    <BookRevFreightTax>0</BookRevFreightTax>
                    <BookFinServiceFee>0</BookFinServiceFee>
                    <BookRevLoadSavings>0</BookRevLoadSavings>
                    <TotalNonFuelFees>0</TotalNonFuelFees>
                    <BookPickNumber>0</BookPickNumber>
                    <BookPickupStopNumber>0</BookPickupStopNumber>
                    <PLExportRetry>0</PLExportRetry>
                    <PLExportDate>11/07/2023</PLExportDate>
                    <PLExported>true</PLExported>
                    <CarrierAlphaCode>Test</CarrierAlphaCode>
                    <CarrierLegalEntity>Test</CarrierLegalEntity>
                    <CompLegalEntity>Test</CompLegalEntity>
                    <CompAlphaCode>Test</CompAlphaCode>
                    <LaneLegalEntity>Test</LaneLegalEntity>
                    <BookOriginalLaneNumber>Test</BookOriginalLaneNumber>
                    <BookAlternateAddressLaneNumber>Test</BookAlternateAddressLaneNumber>
                    <BookSHID>Test</BookSHID>
                    <BookOriginalLaneLegalEntity>Test</BookOriginalLaneLegalEntity>
                    <BookWhseAuthorizationNo>Test</BookWhseAuthorizationNo>
                    <BookShipCarrierName>Test</BookShipCarrierName>
                    <BookRevNonTaxable>0</BookRevNonTaxable>
                    <BookFinAPGLNumber>Test</BookFinAPGLNumber>
                    <Lines>
                        <BookCarrOrderNumber>Test</BookCarrOrderNumber>
                        <ItemNumber>Test</ItemNumber>
                        <QtyOrdered>0</QtyOrdered>
                        <FreightCost>0</FreightCost>
                        <ItemCost>0</ItemCost>
                        <Weight>0</Weight>
                        <Cube>0</Cube>
                        <Pack>0</Pack>
                        <Size>Test</Size>
                        <Description>Test</Description>
                        <CustomerItemNumber>Test</CustomerItemNumber>
                        <CustomerNumber>Test</CustomerNumber>
                        <OrderSequence>0</OrderSequence>
                        <Hazmat>N</Hazmat>
                        <Brand>Test</Brand>
                        <CostCenter>Test</CostCenter>
                        <LotNumber>Test</LotNumber>
                        <LotExpirationDate>11/07/2023</LotExpirationDate>
                        <GTIN>Test</GTIN>
                        <BFC>0</BFC>
                        <CountryOfOrigin>Test</CountryOfOrigin>
                        <CustomerPONumber>Test</CustomerPONumber>
                        <HST>Test</HST>
                        <BookProNumber>Test</BookProNumber>
                        <PalletType>Test</PalletType>
                        <PLControl>10</PLControl>
                        <CompNatNumber>0</CompNatNumber>
                        <BookRouteConsFlag>true</BookRouteConsFlag>
                        <BookAlternateAddressLaneNumber>Test</BookAlternateAddressLaneNumber>
                        <CompLegalEntity>Test</CompLegalEntity>
                        <CompAlphaCode>Test</CompAlphaCode>
                        <BookItemDiscount>0</BookItemDiscount>
                        <BookItemLineHaul>0</BookItemLineHaul>
                        <BookItemTaxableFees>0</BookItemTaxableFees>
                        <BookItemTaxes>0</BookItemTaxes>
                        <BookItemNonTaxableFees>0</BookItemNonTaxableFees>
                        <BookItemWeightBreak>0</BookItemWeightBreak>
                        <BookItemRated49CFRCode>Test</BookItemRated49CFRCode>
                        <BookItemRatedIATACode>Test</BookItemRatedIATACode>
                        <BookItemRatedDOTCode>Test</BookItemRatedDOTCode>
                        <BookItemRatedMarineCode>Test</BookItemRatedMarineCode>
                        <BookItemRatedNMFCClass>Test</BookItemRatedNMFCClass>
                        <BookItemRatedNMFCSubClass>Test</BookItemRatedNMFCSubClass>
                        <BookItemRatedFAKClass>Test</BookItemRatedFAKClass>
                        <HazmatTypeCode>Test</HazmatTypeCode>
                        <Hazmat49CFRCode>Test</Hazmat49CFRCode>
                        <IATACode>Test</IATACode>
                        <DOTCode>Test</DOTCode>
                        <MarineCode>Test</MarineCode>
                        <NMFCClass>Test</NMFCClass>
                        <FAKClass>Test</FAKClass>
                        <LimitedQtyFlag>true</LimitedQtyFlag>
                        <Pallets>0</Pallets>
                        <Ties>0</Ties>
                        <Highs>0</Highs>
                        <QtyPalletPercentage>0</QtyPalletPercentage>
                        <QtyLength>0</QtyLength>
                        <QtyWidth>0</QtyWidth>
                        <QtyHeight>0</QtyHeight>
                        <Stackable>0</Stackable>
                        <LevelOfDensity>0</LevelOfDensity>
                        <BookItemOrderNumber>Test</BookItemOrderNumber>
                    </Lines>
                </Pick>
                <Pick xmlns="urn:microsoft-dynamics-nav/xmlports/DynamicsTMSPick">
                    <PLControl>11</PLControl>
                    <BookCarrOrderNumber>Test</BookCarrOrderNumber>
                    <BookConsPrefix>Test</BookConsPrefix>
                    <CarrierNumber>0</CarrierNumber>
                    <BookRevTotalCost>100</BookRevTotalCost>
                    <LoadOrder>0</LoadOrder>
                    <BookDateLoad>11/07/2023</BookDateLoad>
                    <BookDateRequired>11/07/2023</BookDateRequired>
                    <BookLoadCom>D</BookLoadCom>
                    <BookProNumber>Test</BookProNumber>
                    <BookRouteFinalCode>NS</BookRouteFinalCode>
                    <BookRouteFinalDate>11/07/2023</BookRouteFinalDate>
                    <BookTotalCases>0</BookTotalCases>
                    <BookTotalWgt>0</BookTotalWgt>
                    <BookTotalPL>0</BookTotalPL>
                    <BookTotalCube>0</BookTotalCube>
                    <BookTotalBFC>0</BookTotalBFC>
                    <BookStopNo>0</BookStopNo>
                    <CompName>Test</CompName>
                    <CompNumber>test</CompNumber>
                    <BookTypeCode>N</BookTypeCode>
                    <BookDateOrdered>11/07/2023</BookDateOrdered>
                    <BookOrigName>Test</BookOrigName>
                    <BookOrigAddress1>TEST</BookOrigAddress1>
                    <BookOrigAddress2>Test</BookOrigAddress2>
                    <BookOrigAddress3>Test</BookOrigAddress3>
                    <BookOrigCity>Test</BookOrigCity>
                    <BookOrigState>TN</BookOrigState>
                    <BookOrigCountry>Test</BookOrigCountry>
                    <BookOrigZip>Test</BookOrigZip>
                    <BookDestName>Test</BookDestName>
                    <BookDestAddress1>Test</BookDestAddress1>
                    <BookDestAddress2>Test</BookDestAddress2>
                    <BookDestAddress3>Test</BookDestAddress3>
                    <BookDestCity>Test</BookDestCity>
                    <BookDestState>TN</BookDestState>
                    <BookDestCountry>Test</BookDestCountry>
                    <BookDestZip>Test</BookDestZip>
                    <BookLoadPONumber>Test</BookLoadPONumber>
                    <CarrierName>Test</CarrierName>
                    <LaneNumber>Test</LaneNumber>
                    <CommCodeDescription>Test</CommCodeDescription>
                    <BookMilesFrom>Test</BookMilesFrom>
                    <BookCommCompControl>0</BookCommCompControl>
                    <BookRevCommCost>0</BookRevCommCost>
                    <BookRevGrossRevenue>0</BookRevGrossRevenue>
                    <BookFinCommStd>0</BookFinCommStd>
                    <BookDoNotInvoice>false</BookDoNotInvoice>
                    <BookOrderSequence>0</BookOrderSequence>
                    <CarrierEquipmentCodes>Test</CarrierEquipmentCodes>
                    <BookCarrierTypeCode>Test</BookCarrierTypeCode>
                    <BookWarehouseNumber>Test</BookWarehouseNumber>
                    <CompNatNumber>0</CompNatNumber>
                    <BookTransType>Test</BookTransType>
                    <BookShipCarrierProNumber>Test</BookShipCarrierProNumber>
                    <BookShipCarrierNumber>Test</BookShipCarrierNumber>
                    <LaneComments>Test</LaneComments>
                    <FuelSurCharge>0</FuelSurCharge>
                    <BookRevCarrierCost>0</BookRevCarrierCost>
                    <BookRevOtherCost>0</BookRevOtherCost>
                    <BookRevNetCost>0</BookRevNetCost>
                    <BookRevFreightTax>0</BookRevFreightTax>
                    <BookFinServiceFee>0</BookFinServiceFee>
                    <BookRevLoadSavings>0</BookRevLoadSavings>
                    <TotalNonFuelFees>0</TotalNonFuelFees>
                    <BookPickNumber>0</BookPickNumber>
                    <BookPickupStopNumber>0</BookPickupStopNumber>
                    <PLExportRetry>0</PLExportRetry>
                    <PLExportDate>11/07/2023</PLExportDate>
                    <PLExported>true</PLExported>
                    <CarrierAlphaCode>Test</CarrierAlphaCode>
                    <CarrierLegalEntity>Test</CarrierLegalEntity>
                    <CompLegalEntity>Test</CompLegalEntity>
                    <CompAlphaCode>Test</CompAlphaCode>
                    <LaneLegalEntity>Test</LaneLegalEntity>
                    <BookOriginalLaneNumber>Test</BookOriginalLaneNumber>
                    <BookAlternateAddressLaneNumber>Test</BookAlternateAddressLaneNumber>
                    <BookSHID>Test</BookSHID>
                    <BookOriginalLaneLegalEntity>Test</BookOriginalLaneLegalEntity>
                    <BookWhseAuthorizationNo>Test</BookWhseAuthorizationNo>
                    <BookShipCarrierName>Test</BookShipCarrierName>
                    <BookRevNonTaxable>0</BookRevNonTaxable>
                    <BookFinAPGLNumber>Test</BookFinAPGLNumber>
                    <Lines>
                        <BookCarrOrderNumber>Test</BookCarrOrderNumber>
                        <ItemNumber>Test</ItemNumber>
                        <QtyOrdered>0</QtyOrdered>
                        <FreightCost>0</FreightCost>
                        <ItemCost>0</ItemCost>
                        <Weight>0</Weight>
                        <Cube>0</Cube>
                        <Pack>0</Pack>
                        <Size>Test</Size>
                        <Description>Test</Description>
                        <CustomerItemNumber>Test</CustomerItemNumber>
                        <CustomerNumber>Test</CustomerNumber>
                        <OrderSequence>0</OrderSequence>
                        <Hazmat>N</Hazmat>
                        <Brand>Test</Brand>
                        <CostCenter>Test</CostCenter>
                        <LotNumber>Test</LotNumber>
                        <LotExpirationDate>11/07/2023</LotExpirationDate>
                        <GTIN>Test</GTIN>
                        <BFC>0</BFC>
                        <CountryOfOrigin>Test</CountryOfOrigin>
                        <CustomerPONumber>Test</CustomerPONumber>
                        <HST>Test</HST>
                        <BookProNumber>Test</BookProNumber>
                        <PalletType>Test</PalletType>
                        <PLControl>11</PLControl>
                        <CompNatNumber>0</CompNatNumber>
                        <BookRouteConsFlag>true</BookRouteConsFlag>
                        <BookAlternateAddressLaneNumber>Test</BookAlternateAddressLaneNumber>
                        <CompLegalEntity>Test</CompLegalEntity>
                        <CompAlphaCode>Test</CompAlphaCode>
                        <BookItemDiscount>0</BookItemDiscount>
                        <BookItemLineHaul>0</BookItemLineHaul>
                        <BookItemTaxableFees>0</BookItemTaxableFees>
                        <BookItemTaxes>0</BookItemTaxes>
                        <BookItemNonTaxableFees>0</BookItemNonTaxableFees>
                        <BookItemWeightBreak>0</BookItemWeightBreak>
                        <BookItemRated49CFRCode>Test</BookItemRated49CFRCode>
                        <BookItemRatedIATACode>Test</BookItemRatedIATACode>
                        <BookItemRatedDOTCode>Test</BookItemRatedDOTCode>
                        <BookItemRatedMarineCode>Test</BookItemRatedMarineCode>
                        <BookItemRatedNMFCClass>Test</BookItemRatedNMFCClass>
                        <BookItemRatedNMFCSubClass>Test</BookItemRatedNMFCSubClass>
                        <BookItemRatedFAKClass>Test</BookItemRatedFAKClass>
                        <HazmatTypeCode>Test</HazmatTypeCode>
                        <Hazmat49CFRCode>Test</Hazmat49CFRCode>
                        <IATACode>Test</IATACode>
                        <DOTCode>Test</DOTCode>
                        <MarineCode>Test</MarineCode>
                        <NMFCClass>Test</NMFCClass>
                        <FAKClass>Test</FAKClass>
                        <LimitedQtyFlag>true</LimitedQtyFlag>
                        <Pallets>0</Pallets>
                        <Ties>0</Ties>
                        <Highs>0</Highs>
                        <QtyPalletPercentage>0</QtyPalletPercentage>
                        <QtyLength>0</QtyLength>
                        <QtyWidth>0</QtyWidth>
                        <QtyHeight>0</QtyHeight>
                        <Stackable>0</Stackable>
                        <LevelOfDensity>0</LevelOfDensity>
                        <BookItemOrderNumber>Test</BookItemOrderNumber>
                    </Lines>
                </Pick>
            </dynamicsTMSPicks>
        </SendPicks>
    </soap:Body>
</soap:Envelope>



